mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
/* $Id: main.c,v 1.36 2019/03/12 19:24:19 bouyer Exp $ */
/*
 * Copyright (c) 2023 Manuel Bouyer
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
 * TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
 * BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include <xc.h>
#include <stdio.h> 
#include <string.h> 
#include <stdlib.h> 
#include <nmea2000.h>
#include <nmea2000_pgn.h>
#include <raddeg.h>
#include "serial.h"
#include "i2c.h"
#include "ntc_tab.h"
#include "pac195x.h"
#include "font5x8.h"
#include "font10x16.h"
#include "icons16x16.h"

typedef unsigned char u_char;
typedef unsigned int  u_int;
typedef unsigned long u_long;

static u_char default_src;

u_int devid, revid; 

u_long nmea2000_user_id; 

static u_char sid;

static struct nmea2000_msg msg;
static u_char nmea2000_data[NMEA2000_DATA_FASTLENGTH];

u_int timer0_read(void);

#define TIMER0_1MS    10
#define TIMER0_5MS    49
#define TIMER0_20MS   195
#define TIMER0_100MS  977

#define NCANOK  PORTCbits.RC2

#define PWM_OFF   LATCbits.LATC1
#define PWM_OK    PORTCbits.RC0
#define PWM_MID   LATCbits.LATC5 /* high-side resistor for 3-state PWM output */
#define PWM_OUT   LATCbits.LATC6 /* PWM output */
#define PAC_NDOWN LATCbits.LATC7

#define OLED_RSTN LATAbits.LATA4

typedef enum {
	BATT_NONE = 0,
	BATT_1 = 1,
	BATT_2 = 2,
} batt_t;

static void
batt_en(batt_t b)
{
	switch(b) {
	case BATT_NONE:
		CLCSELECT = 2;
		CLCnPOLbits.G2POL = 0;
		CLCSELECT = 3;
		CLCnPOLbits.G2POL = 0;
		break;
	case BATT_1:
		CLCSELECT = 2;
		CLCnPOLbits.G2POL = 1;
		CLCSELECT = 3;
		CLCnPOLbits.G2POL = 0;
		break;
	case BATT_2:
		CLCSELECT = 2;
		CLCnPOLbits.G2POL = 0;
		CLCSELECT = 3;
		CLCnPOLbits.G2POL = 1;
		break;
	}
}

static batt_t active_batt;

static char counter_100hz;
static char counter_100hz;
static char counter_10hz;
static uint16_t seconds;
static volatile union softintrs {
	struct softintrs_bits {
		char int_100hz : 1;	/* 0.01s timer */
		char int_btn_down : 1;	/* button release->press */
		char int_btn_up : 1;	/* button press->release */
		char int_adcc : 1;	/* A/D convertion complete */
	} bits;
	char byte;
} softintrs;

static union time_events {
	struct tmev_bits {
		char ev_100hz : 1;	/* 0.01s timer */
		char ev_10hz : 1;	/* 0.1s timer */
		char ev_1hz : 1;	/* 1s timer */
	} bits;
	char byte;
} time_events;

static uint16_t ad_pwm;
static uint16_t ad_solar;
static uint16_t ad_temp;

static uint16_t board_temp;

static union pacops_pending {
	struct pacops_bits {
		char refresh : 1;	/* send a refresh command */
		char refresh_v : 1;	/* send a refresh_v command */
		char read_values : 1;	/* read average values */
		char read_accum : 1;	/* read accumulator values */
	} bits;
	char byte;
} pacops_pending;

u_int pac_refresh_time;
u_char pac_refresh_valid;

/*
 * buffer to read voltage/current values at once 
 * as we're using readreg_be, the register order is inverted
 * Disabled channels are skipped, so only 3 entries
 */
static struct {
	int16_t batt_i[3];
	uint16_t batt_v[3];
} _read_voltcur;

uint16_t batt_v[3];
int16_t batt_i[3];

/*
 * index:
 * _read_voltcur.batt_i[0] = SOLAR = batt_i[2]
 * _read_voltcur.batt_i[1] = BATT_2 = -batt_i[1]
 * _read_voltcur.batt_i[2] = BATT_1 = -batt_i[0]
 *
 * _read_voltcur.batt_v[0] = SOLAR = batt_v[2]
 * _read_voltcur.batt_v[1] = BATT_2 = batt_v[1]
 * _read_voltcur.batt_v[2] = BATT_1 = batt_v[0]
 */

static uint32_t voltages_acc[3];
pac_ctrl_t pac_ctrl;

static union pac_events {
	struct pacevts_bits {
		char pacavg_rdy : 1;	/* _read_voltcur updated */
		char pacavg_rdy_chrg : 1;/* _read_voltcur updated for chrg */
		char pacacc_rdy : 1;	/* _read_accum updated */
		char bvalues_updated : 1; /* batt_i[] & batt_v[] updated */
	} bits;
	char byte;
} pac_events;

static enum {
	BTN_IDLE = 0,
	BTN_DOWN,
	BTN_DOWN_1,
	BTN_DOWN_1_P,
	BTN_DOWN_2,
	BTN_DOWN_2_P,
	BTN_UP
} btn_state;

/*
 * PWM fsm:
 * DOWN: everything off (PWM_OFF = 1, PWM_MID = PWM_OUT = 0), wait for power
	 up order
 * TURNON: PWM_OFF = 1, PWM_MID = PWM_OUT = 0
 * ON: PWM_OFF = 0, waiting for PWM_OK
 * OK: PWM_OK asserted, turn on PWM_MID, set up PWM registers and 
 *     connect PWM_OUT to PWM
 * IDLE: hardware ready, waiting for PWM values
 * RUNNING: providing PWM signal
 * GOIDLE: prepare for off: PWM_OUT = 0
 * BATTOFF: prepare for off: BATT1_OFF, bATT2_OFF
 * DISCHARGE: prepare for off: PWM_OUT = 0, PWM_MID = 0,
 */
static enum {
	PWMF_DOWN = 0,
	PWMF_TURNON,
	PWMF_ON,
	PWMF_OK,
	PWMF_IDLE,
	PWMF_RUNNING,
	PWMF_GOIDLE,
	PWMF_BATTOFF,
	PWMF_DISCHARGE,
} pwm_fsm;

static volatile union pwm_events {
	struct pwm_evtbits {
		char goon : 1;	/* turn PWM on */
		char gooff : 1; /* turn PWM off */
	} bits;
	char byte;
} pwm_events;

static enum {
	PWME_NOERROR = 0,
	PWME_PWMV,
	PWME_PWMOK,
	PWME_OVERTEMP,
	PWME_BATTCUR,
} pwm_error;

#define TEMP_MAX ((uint16_t)27315 + 7000) /* 70 deg celius */
#define TEMP_RESTART ((uint16_t)TEMP_MAX - 1000) /* 10 deg below TEMP_MAX */

uint16_t pwm_time;
uint8_t pwme_time;

