mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
uint8_t pwm_duty_c; /* duty cycle in % * 2 */
#define PWM_DUTY_MAX 198

static inline void
pwmf_goidle()
{
	pwm_events.bits.gooff = 0;
	PWM1CONbits.EN = 0;
	CM1CON0bits.EN = 0;
	PIR1bits.C1IF = 0;
	PIE1bits.C1IE = 0;
	PIR0bits.IOCIF = 0;
	IOCCFbits.IOCCF0 = 0;
	PIE0bits.IOCIE = 0;
	pwm_time = timer0_read();
	pwm_fsm = PWMF_GOIDLE;
}

static inline void
pwm_runfsm()
{
	switch(pwm_fsm) {
	case PWMF_DOWN:
		PWM_OFF = 1;
		PWM_MID = 0;
		PWM_OUT = 0;
		if (pwm_error != PWME_NOERROR)
			return;
		if (pwm_events.bits.goon) {
			pwm_events.bits.goon = 0;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_TURNON;
			CM1CON0bits.EN = 1; /* need to turn on early */
		}
		break;
	case PWMF_TURNON:
		if ((timer0_read() - pwm_time) > TIMER0_100MS) {
			PWM_OFF = 0;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_ON;
		}
		break;
	case PWMF_ON:
		if (PWM_OK) {
			pwm_fsm = PWMF_OK;
		}
		if ((timer0_read() - pwm_time) > TIMER0_100MS) {
			/* timeout, retry */
			printf("PWM_OK tout\n");
			PWM_OFF = 1;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_TURNON;
		}
		break;
	case PWMF_OK:
		PWM_MID = 1;
		PWM1PR = 512; /* pwm at 125Khz */
		PWM1S1P1 = 0; /* default to off */
		PWM1CONbits.EN = 1;
		PIR1bits.C1IF = 0;
		PIE1bits.C1IE = 1;
		PIR0bits.IOCIF = 0;
		IOCCFbits.IOCCF0 = 0;
		PIE0bits.IOCIE = 1;
		pwm_fsm = PWMF_IDLE;
		break;
	case PWMF_IDLE:
		if (pwm_events.bits.gooff) {
			pwmf_goidle();
		}
		break;
	case PWMF_RUNNING:
		if (pwm_events.bits.gooff) {
			pwmf_goidle();
		}
		break;
	case PWMF_GOIDLE:
		if ((timer0_read() - pwm_time) > TIMER0_20MS) {
			printf("PWM OFF CON 0x%x PR 0x%x P1 0x%x B 0x%x C 0x%x\n", 
			    PWM1CON,
			    PWM1PR,
			    PWM1S1P1,
			    PORTB,
			    PORTC);
			batt_en(0);
			pwm_time = timer0_read();
			pwm_fsm = PWMF_BATTOFF;
		}
		break;
	case PWMF_BATTOFF:
		if ((timer0_read() - pwm_time) > TIMER0_5MS) {
			PWM_MID = 0;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_DISCHARGE;
		}
		break;
	case PWMF_DISCHARGE:
		if ((timer0_read() - pwm_time) > TIMER0_20MS) {
			PWM_OFF = 1;
			pwm_fsm = PWMF_DOWN;
		}
		break;
	}
}

static void
pwm_set_duty()
{
	uint32_t v;
	/*
	 * off time needs to be at last 500ns (the NCP5901B's ZCD blanking
	 * timer is 250ns
	 */
#define PWM_MIN_OFF 32

	/* experiments show we can't go above 98% */
	if (pwm_duty_c > 240) /* assume overflow */
		pwm_duty_c = 0;
	else if (pwm_duty_c > 198)
		pwm_duty_c = 198;

	/* first try running at 125Khz */
	v = (uint32_t)512 * (uint32_t)pwm_duty_c / 200;
	// printf("v 0x%lx ", v);
	if (512 - v >= PWM_MIN_OFF) {
		PWM1PR = 512;
		PWM1S1P1 = (uint16_t)v;
	} else {
		/* duty cycle too large, decrease PWM frequency */
		/* PR = PWM_MIN_OFF / (1 - pwm_duty_c / 200) */
		/* PR = PWM_MIN_OFF * 200 / (200 - pwm_duty_c) */
		PWM1PR = (PWM_MIN_OFF * 200) / (200 - pwm_duty_c);
		PWM1S1P1 = PWM1PR - PWM_MIN_OFF;
	}
	// printf("PWM1PR 0x%x S1P1 0x%x\n", PWM1PR, PWM1S1P1);
	PWM1CONbits.LD = 1;
}

typedef enum {
	CHRG_DOWN = 0,
	CHRG_PWMUP,
	CHRG_RAMPUP,
	CHRG_MPPT,
	CHRG_CV,
	CHRG_BSWITCH,
	CHRG_BSWITCH_WAIT,
	CHRG_GODOWN
} chrg_fsm_t;

static chrg_fsm_t chrg_fsm;

static volatile union chrg_events {
	struct chrg_evtbits {
		char goon : 1;	/* turn charger on */
		char gooff : 1; /* turn charger off */
		char battswitch : 1; /* cause a battery switch */
	} bits;
	char byte;
} chrg_events;

static uint16_t chrg_previous_current;
static uint16_t chrg_current_accum;
static uint8_t chrg_accum_cnt;
static int8_t chrg_duty_change;
static uint8_t chrg_volt_target_cnt;
static uint8_t chrg_batt_grace; /* grace cycles after batt switch in CV mode */

struct chrg_param {
	uint8_t chrgp_pwm; /* pwm value */
	int16_t chrgp_iout; /* intensity output */
};

typedef enum {
	BATTS_NONE = 0, /* uninitialised */
	BATTS_CC, /* charge at max current */
	BATTS_CV, /* charge at constant voltage */
	BATTS_CV_FLOAT, /* charge at constant voltage */
	BATTS_ERR, /* error state */
} batt_state_t;

typedef struct {
	batt_state_t bc_stat;
	uint16_t bc_cv; /* target voltage */
	chrg_fsm_t bc_chrg_fsm; /* chrg state to resume at */
	struct chrg_param bc_chrg; /* current chrg state */
	struct chrg_param bc_r_chrg; /* best chrg state during rampup */
	u_int bc_sw_time; /* timer0() at last on switch */
} batt_context_t;

static batt_context_t battctx[2];
#define active_bidx (active_batt - BATT_1)
#define active_battctx (battctx[active_bidx])
#define active_battv (batt_v[active_bidx])
#define active_batti (batt_i[active_bidx])

#define BATT_MINV 80 /* if battery below 8V don't start chrg */

static char
batt_switch_active()
{
	switch(active_batt) {
	case BATT_1:
		if (battctx[BATT_2 - BATT_1].bc_stat != BATTS_NONE &&
		    battctx[BATT_2 - BATT_1].bc_stat != BATTS_ERR) {
			printf("bact 1 2\n");
			active_batt = BATT_2;
			return 1;
		}
		break;
	case BATT_2:
		if (battctx[BATT_1 - BATT_1].bc_stat != BATTS_NONE &&
		    battctx[BATT_1 - BATT_1].bc_stat != BATTS_ERR) {
			active_batt = BATT_1;
			printf("bact 2 1\n");
			return 1;
		}
		break;
	default:
		break;
	}
	return 0;
}

static void
schedule_batt_switch()
{
	/* check if a battery switch is needed:
	 * compute weight  of each battery: if one * is cc and one is cv,
	 * give 90/10% of time.
	 * if both are in the same state, give 50/50%
	 * One time slot is 1s, we compute the number of 1/10s allocated
	 * to active battery.
	 */
	uint8_t bw[2], sum, c;
	uint16_t time;
	sum = 0;
	for (c = 0; c < 2; c++) {
		bw[c] = 0;
		switch(battctx[c].bc_stat) {
		case BATTS_CC:
		case BATTS_CV:
		case BATTS_CV_FLOAT:
			switch(battctx[c].bc_chrg_fsm) {
			case CHRG_MPPT:
			case CHRG_RAMPUP:
				bw[c] = 90;
				break;
			case CHRG_CV:
				bw[c] = 10;
				break;
			default:
				break;
			}
		default:
			break;
		}
		sum += bw[c];
	}
	sum = sum / 10;
	time = bw[active_bidx] / sum;
	if (time < 10) {
		time = time * TIMER0_100MS;
		/* need a switch */
		if (chrg_events.bits.battswitch) {
			/* already pending, update currently running time */
			active_battctx.bc_sw_time = timer0_read() -
			    (TIMER0_100MS * 10);
		} else if ((timer0_read() - active_battctx.bc_sw_time) > time) {
			chrg_events.bits.battswitch = 1;
		}
	}
}

static void
chrg_runfsm()
{
	if (pwm_error != 0)
		chrg_events.bits.gooff = 1;
	switch(chrg_fsm) {
	case CHRG_DOWN:
		if (chrg_events.bits.goon) {
			chrg_events.bits.goon = 0;
			chrg_events.bits.gooff = 0;
			pwm_events.bits.gooff = 0;
			pwm_events.bits.goon = 1;
			chrg_fsm = CHRG_PWMUP;
		}
		break;

	case CHRG_PWMUP:
		if (chrg_events.bits.gooff) {
			chrg_fsm = CHRG_GODOWN;
		} else if (pwm_fsm == PWMF_IDLE && active_batt != BATT_NONE) {
			if (active_battctx.bc_stat != BATTS_NONE &&
			    active_battctx.bc_stat != BATTS_ERR) {
				batt_en(active_batt);
				active_battctx.bc_sw_time = timer0_read();
				pwm_duty_c = 20; /* start at 10% */
				pwm_set_duty();
				active_battctx.bc_r_chrg.chrgp_iout = -1;
				pwm_fsm = PWMF_RUNNING;
				printf("PWM RUN CON 0x%x PR 0x%x P1 0x%x act %d\n", 
				    PWM1CON,
				    PWM1PR,
				    PWM1S1P1,
				    active_batt);
				chrg_fsm = CHRG_RAMPUP;
			} else {
				if (active_batt == BATT_1)
					active_batt = BATT_2;
				else
					active_batt = BATT_1;
			}
		}
		break;

	case CHRG_RAMPUP:
		if (chrg_events.bits.gooff) {
			chrg_fsm = CHRG_GODOWN;
			return;
		}
		if (pac_events.bits.pacavg_rdy_chrg) {
			if ((active_battv / 10) > active_battctx.bc_cv) {
				/* if we're at target voltage go to CV mode */
				chrg_volt_target_cnt = 0;
				chrg_fsm = CHRG_CV;
				chrg_batt_grace = 0;
			} else {
				char i;

				/* battery current is inverted */
				int16_t battcur =
				    -_read_voltcur.batt_i[2 - active_bidx];
				if (active_battctx.bc_r_chrg.chrgp_iout <
				    battcur) {
					active_battctx.bc_r_chrg.chrgp_iout =
					    battcur;
					active_battctx.bc_r_chrg.chrgp_pwm =
					    pwm_duty_c;
				}
				if (pwm_duty_c == PWM_DUTY_MAX) {
					/* scan done */
					printf("b %d end scan curr %d pwm %d\n",
					    active_batt, 
					    active_battctx.bc_r_chrg.chrgp_iout,
					    active_battctx.bc_r_chrg.chrgp_pwm);
					pwm_duty_c = active_battctx.bc_r_chrg.chrgp_pwm;
					pwm_set_duty();
					chrg_current_accum = 0;
					chrg_accum_cnt = 4;
					chrg_duty_change = 8;
					chrg_fsm = CHRG_MPPT;
				} else {
					pwm_duty_c += 5;
					if (pwm_duty_c > PWM_DUTY_MAX)
						pwm_duty_c = PWM_DUTY_MAX;
					pwm_set_duty();
				}
			}
		}
		break;
			
	case CHRG_MPPT:
		if (chrg_events.bits.gooff) {
			chrg_fsm = CHRG_GODOWN;
		} else if (pac_events.bits.pacavg_rdy_chrg) {
			chrg_current_accum +=
			    (uint16_t)(-_read_voltcur.batt_i[2 - active_bidx]);
			chrg_accum_cnt--;
			if (chrg_accum_cnt == 0) {
#if 0
				char c;
				c = (chrg_current_accum >> 12) & 0x0f;
				if (c > 9)
					usart_putchar('A' - 10 + c);
				else
					usart_putchar('0' + c);
				c = (chrg_current_accum >> 8) & 0x0f;
				if (c > 9)
					usart_putchar('A' - 10 + c);
				else
					usart_putchar('0' + c);
				c = (chrg_current_accum >> 4) & 0x0f;
				if (c > 9)
					usart_putchar('A' - 10 + c);
				else
					usart_putchar('0' + c);
				c = (chrg_current_accum >> 0) & 0x0f;
				if (c > 9)
					usart_putchar('A' - 10 + c);
				else
					usart_putchar('0' + c);
				usart_putchar('_');
				c = (pwm_duty_c >> 4) & 0x0f;
				if (c > 9)
					usart_putchar('A' - 10 + c);
				else
					usart_putchar('0' + c);
				c = (pwm_duty_c >> 0) & 0x0f;
				if (c > 9)
					usart_putchar('A' - 10 + c);
				else
					usart_putchar('0' + c);
				usart_putchar(' ');
#endif
				if (chrg_previous_current > chrg_current_accum){
					/* wrong move */
					if (chrg_duty_change < 0)
						chrg_duty_change = 8;
					else
						chrg_duty_change = -8;
				} else {
					/*
					 * right move; try a bit faster
					 *  but only every 8 update cycle
					 * in the right direction
					 */
					if (chrg_duty_change < 0) {
						chrg_duty_change += -1;
						if (chrg_duty_change < -64)
							chrg_duty_change = -64;
					} else {
						chrg_duty_change += 1;
						if (chrg_duty_change > 64)
							chrg_duty_change = 64;
					}
				}

