mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
				chrg_previous_current = chrg_current_accum;
				pwm_duty_c += (chrg_duty_change >> 3);
				pwm_set_duty();
				chrg_accum_cnt = 4;
				chrg_current_accum = 0;
			}
		}
		if (pac_events.bits.bvalues_updated) {
			pac_events.bits.bvalues_updated = 0;
			if ((active_battv / 10) > active_battctx.bc_cv + 1) {
				chrg_volt_target_cnt++;
				/*
				 * if we're above target + 0.1 for more than
				 * 1s, or above target + 0.5, switch to
				 * CV mode.
				 */
				if (chrg_volt_target_cnt > 100 || /* 1s */
				    (active_battv / 10) > active_battctx.bc_cv + 5) {
					chrg_volt_target_cnt = 0;
					chrg_fsm = CHRG_CV;
					chrg_batt_grace = 0;
				}
			} else {
				chrg_volt_target_cnt = 0;
			}
		}
		if (chrg_events.bits.battswitch &&
		    chrg_current_accum == 0 && chrg_volt_target_cnt == 0 &&
		    chrg_fsm == CHRG_MPPT) {
			chrg_events.bits.battswitch = 0;
			active_battctx.bc_chrg_fsm = chrg_fsm;
			active_battctx.bc_chrg.chrgp_pwm = pwm_duty_c;
			active_battctx.bc_chrg.chrgp_iout =
			    chrg_previous_current / 4;
			chrg_fsm = CHRG_BSWITCH;
		}
		break;
		
	case CHRG_CV:
		if (chrg_events.bits.gooff) {
			chrg_fsm = CHRG_GODOWN;
		}
		if (pac_events.bits.bvalues_updated) {
			pac_events.bits.bvalues_updated = 0;
			if ((active_battv / 10) < active_battctx.bc_cv - 1) {
				chrg_volt_target_cnt++;
				if (chrg_batt_grace)
					chrg_batt_grace--;
				/*
				 * if we're below target - 0.1 for more than
				 * 1s, or below target - 0.5, switch to
				 * MPPT mode, but wait for grace counter
				 */
				if (chrg_batt_grace == 0 &&
				    (chrg_volt_target_cnt > 10 || /* 0.1s */
				    (active_battv / 10) < active_battctx.bc_cv - 5)) {
					pwm_duty_c = 20; /* start at 10% */
					pwm_set_duty();
					active_battctx.bc_r_chrg.chrgp_iout = -1;
					chrg_fsm = CHRG_RAMPUP;
					chrg_volt_target_cnt = 0;
				}
			} else {
				chrg_volt_target_cnt = 0;
				if (chrg_events.bits.battswitch) {
					chrg_events.bits.battswitch = 0;
					active_battctx.bc_chrg_fsm = chrg_fsm;
					active_battctx.bc_chrg.chrgp_pwm = pwm_duty_c;
					chrg_fsm = CHRG_BSWITCH;
				}
			}
			if (active_battv / 10 > active_battctx.bc_cv) 
				pwm_duty_c--;
			else if (active_battv / 10 < active_battctx.bc_cv) 
				pwm_duty_c++;
			pwm_set_duty();
		}
		break;

	case CHRG_BSWITCH:
		if (chrg_events.bits.gooff) {
			chrg_fsm = CHRG_GODOWN;
		} else if (batt_switch_active()) {
			pwm_duty_c = 0;
			pwm_set_duty();
			batt_en(0);
			switch(pwm_fsm) {
			case PWMF_RUNNING:
			case PWMF_IDLE:
				pwm_fsm = PWMF_IDLE;
				active_battctx.bc_sw_time = timer0_read();
				chrg_fsm = CHRG_BSWITCH_WAIT;
				break;
			default:
				chrg_fsm = CHRG_GODOWN;
				break;
			}
		} else {
			/* back to previous state */
			chrg_fsm = active_battctx.bc_chrg_fsm;
		}
		break;
	case CHRG_BSWITCH_WAIT:
		if (chrg_events.bits.gooff) {
			chrg_fsm = CHRG_GODOWN;
		} else if ((timer0_read() - active_battctx.bc_sw_time) >
		    TIMER0_1MS) {
			batt_en(active_batt);
			chrg_volt_target_cnt = 0;
			chrg_current_accum = 0;
			chrg_accum_cnt = 4;
			chrg_duty_change = 8;
			chrg_fsm = active_battctx.bc_chrg_fsm;
			pwm_duty_c = active_battctx.bc_chrg.chrgp_pwm;
			chrg_previous_current =
			    (uint16_t)active_battctx.bc_chrg.chrgp_iout * 4;
			pwm_set_duty();
			pwm_fsm = PWMF_RUNNING;
			/*
			 * wait 4 read cycles before updating PWM
			 * (we have minimum 10 read cycles before switching)
			 */
			chrg_batt_grace = 4;
		}
		break;
	case CHRG_GODOWN:
		if (chrg_events.bits.gooff) {
			chrg_events.bits.gooff = 0;
			chrg_events.bits.goon = 0;
			pwm_events.bits.gooff = 1;
		}
		if (pwm_fsm == PWMF_DOWN)
			chrg_fsm = CHRG_DOWN;
		break;
	}
	pac_events.bits.pacavg_rdy_chrg = 0;
}

#define PAC_I2C_ADDR 0x2e

static volatile i2c_return_t i2c_return;

/* for journal */
static int64_t l600_current_acc[4];
static __uint24 l600_current_count;
static uint32_t l600_voltages_acc[4];

/* check negative current on battery */
static uint8_t negative_current_count;

/* PAC 195x state machine */

static struct pac_i2c_io {
	enum {
		PAC_FREE = 0,
		PAC_WRITE, /* general register write */
		PAC_READ, /* general register read */
		PAC_READ_ACCUM, /* read accumulator values */
		PAC_READ_AVG, /* read recent average values */
	} pac_type;
	u_char pac_reg; /* register address */
	void *pac_data; /* pointer to data for read/write */
	u_char pac_datalen;
} pac_i2c_io;

#define PAC_WRITEREG(reg, data) {\
	pac_i2c_io.pac_type = PAC_WRITE;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = &(data);\
	pac_i2c_io.pac_datalen = sizeof(data);\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

#define PAC_READREG(reg, data) {\
	pac_i2c_io.pac_type = PAC_READ;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = &(data);\
	pac_i2c_io.pac_datalen = sizeof(data);\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

#define PAC_WRITECMD(reg) {\
	pac_i2c_io.pac_type = PAC_WRITE;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = NULL;\
	pac_i2c_io.pac_datalen = 0;\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

/*
 * buffer to read accumulator count and all channel accumulators at once
 * as we're using readreg_be, the register order is inverted
 */
static struct { 
	u_char accum[3*7]; 
	pac_acccnt_t acc_count;
} _read_accum;

static enum {
	PAC_I2C_IDLE,
	PAC_I2C_ERROR, /* got error */
	PAC_I2C_COMPLETE, /* transaction complete */
	PAC_I2C_WAIT, /* waiting for i2c bus */
	PAC_I2C_WRITE,/* sending data */
	PAC_I2C_READ, /* reading data */
} pac_i2c_state;

static void
pac_i2c_exec(void)
{
	switch(pac_i2c_state) {
	case PAC_I2C_IDLE:
	case PAC_I2C_COMPLETE:
	case PAC_I2C_ERROR:
		return;
	case PAC_I2C_WAIT:
		switch(pac_i2c_io.pac_type) {
		case PAC_WRITE:
			i2c_writereg_be(PAC_I2C_ADDR, pac_i2c_io.pac_reg,
			    pac_i2c_io.pac_data, pac_i2c_io.pac_datalen,
			    &i2c_return);
			pac_i2c_state = PAC_I2C_WRITE;
			return;
		case PAC_READ:
			i2c_readreg_be(PAC_I2C_ADDR, pac_i2c_io.pac_reg,
			    pac_i2c_io.pac_data, pac_i2c_io.pac_datalen,
			    &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		case PAC_READ_ACCUM:
			i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCCNT,
			    (void *)&_read_accum, sizeof(_read_accum), &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		case PAC_READ_AVG:
			i2c_readreg_be(PAC_I2C_ADDR, PAC_VBUS1_AVG,
			    (void *)&_read_voltcur, sizeof(_read_voltcur), &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		default:
			printf("pac_i2c_exec PAC_I2C_WAIT bad type %d\n",
			    pac_i2c_io.pac_type);
		}
		return;
	case PAC_I2C_WRITE:
	case PAC_I2C_READ:
		switch(i2c_return) {
		case I2C_INPROGRESS:
			return;
		case I2C_COMPLETE:
			pac_i2c_state = PAC_I2C_COMPLETE;
			return;
		case I2C_ERROR:
			/* XXX */
			printf("pac command %d %d fail\n", 
			    pac_i2c_io.pac_type, pac_i2c_io.pac_reg);
			pac_i2c_state = PAC_I2C_ERROR;
			return;
		}
	}
}

