mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
/*
 * page status:
 *  0: update state
 *  > 0: init state, with multiple init steps\
 * set to 1 on page switch
 */
uint8_t page_status; 

static void
battstat2buf_small(u_char b)
{
	double amps = (double)batt_i[b] / 100;
	double volts = (double)batt_v[b] / 100;
	if (amps > 9.99 || amps < 0) {
		if (volts < 10.0) {
			sprintf(oled_displaybuf,
			    " %1.01fV\n-.--A", volts);
		} else {
			sprintf(oled_displaybuf,
			    "%2.01fV\n-.--A", volts);
		}
	} else {
		if (volts < 10.0) {
			sprintf(oled_displaybuf,
			    " %1.01fV\n%1.02fA", volts, amps);
		} else {
			sprintf(oled_displaybuf,
			    "%2.01fV\n%1.02fA", volts, amps);
		}
	}
	displaybuf_small();
}

static void
display_battstat_small_init()
{
	/* clear display and put static infos */
	switch(page_status) {
	case 1:
		if (display_clear() == 0)
			return;
		page_status++;
		/* fallthrough */
	case 2:
		oled_col = 0;
		oled_line = 0;
		if (displaybuf_icon(ICON_SUN) == 0)
			return;
		page_status++;
		/* fallthrough */
	case 3:
		oled_col = 0;
		oled_line = 3;
		if (displaybuf_icon(ICON_LIGHT) == 0)
			return;
		page_status++;
		/* fallthrough */
	case 4:
		oled_col = 0;
		oled_line = 6;
		if (displaybuf_icon(ICON_ENGINE) == 0)
			return;
		page_status++;
		/* fallthrough */
	default:
		/* set page_status to 0 in calling page */
		break;
	}
	return;
}

/* to be called on ev_10hz event */
static void
display_battstat_small()
{
	if (page_status != 0) {
		display_battstat_small_init();
		return;
	}
	if ((counter_10hz & 1) == 1) {
		double amps;
		/* update display 5 times per second */
		/* solar */
		oled_col = 20;
		oled_line = 0;
		battstat2buf_small(2);
		/* batt2 (service) */
		oled_col = 20;
		oled_line = 3;
		battstat2buf_small(1);
		/* batt1 (engine) */
		oled_col = 20;
		oled_line = 6;
		battstat2buf_small(0);
	}
}

static void
display_battstat_debug()
{
	display_battstat_small();
	if (page_status != 0) {
		if (page_status == 5) {
			page_status = 0;
		}
		return;
	}
	/*
	 * once per second display adc output and temperature 
	 * choose a counter_10hz value that doesn't conflict with
	 * display_battstat_small();
	 */
	if (counter_10hz == 2) {
		oled_col = 60;
		oled_line = 1;
		sprintf(oled_displaybuf, "%4x", ad_pwm);
		displaybuf_small();
		oled_col = 60;
		oled_line = 2;
		sprintf(oled_displaybuf, "%4x", ad_solar);
		displaybuf_small();
		oled_col = 60;
		oled_line = 3;
		sprintf(oled_displaybuf, "%2.2f%c", (float)board_temp / 100.0 - 273.15, 20);
		displaybuf_small();
	}
	/* display charger and pwm states 10 times per second */
	oled_col = 54;
	oled_line = 5;
	sprintf(oled_displaybuf, "%1x %1x %1x %2x %1x", pwm_fsm, pwm_error, chrg_fsm, pwm_duty_c, active_batt);
	displaybuf_small();
}


static void
battstat2buf(u_char b)
{
	double amps = (double)batt_i[b] / 100;
	double volts = (double)batt_v[b] / 100;
	if (amps > 9.99 || amps < 0) {
		if (volts < 10.0) {
			sprintf(oled_displaybuf,
			    " %1.01f -.--", volts);
		} else {
			sprintf(oled_displaybuf,
			    "%2.01f -.--", volts);
		}
	} else {
		if (volts < 10.0) {
			sprintf(oled_displaybuf,
			    " %1.01f %1.02f", volts, amps);
		} else {
			sprintf(oled_displaybuf,
			    "%2.01f %1.02f", volts, amps);
		}
	}
	displaybuf_medium();
}

static void
display_battstat_init()
{
	/* clear display and put static infos */
	switch(page_status) {
	case 1:
	case 2:
	case 3:
	case 4:
		display_battstat_small_init();
		return;
	case 5:
		oled_col = 40; /* 20 + 2 * 10 */
		oled_line = 2;
		sprintf(oled_displaybuf, "V       A");
		if (displaybuf_small() == 0)
			return;
		/* fallthrough */
	default:
		page_status = 0;
	}
	return;
}

static void
display_battstat()
{
	if (page_status != 0) {
		display_battstat_init();
		return;
	}
	if ((counter_10hz & 1) == 1) {
		double amps;
		/* update display 5 times per second */
		/* solar */
		oled_col = 20;
		oled_line = 0;
		battstat2buf(2);
		/* batt2 (service) */
		oled_col = 20;
		oled_line = 3;
		battstat2buf(1);
		/* batt1 (engine) */
		oled_col = 20;
		oled_line = 6;
		battstat2buf(0);
	}
}

typedef enum {
	PAGE_BATTSTAT,
	PAGE_BATTSTAT_DEBUG,
} page_t;

static page_t active_page;

static void
display_page()
{
	switch(active_page) {
	case PAGE_BATTSTAT:
		display_battstat();
		break;
	case PAGE_BATTSTAT_DEBUG:
		display_battstat_debug();
		break;
	}
}

static void
next_page()
{
	page_status = 1;
	switch(active_page) {
	case PAGE_BATTSTAT:
		active_page = PAGE_BATTSTAT_DEBUG;
		break;
	case PAGE_BATTSTAT_DEBUG:
		active_page = PAGE_BATTSTAT;
		break;
	}
}

int
main(void)
{
	char c;
	uint16_t l;
	uint8_t i2cr;
	pac_accumcfg_t pac_accumcfg;
	pac_neg_pwr_fsr_t pac_neg_pwr_fsr;
	static u_int poll_count;
	uint16_t t0;
	static int32_t voltages_acc_cur[4];
	uint8_t new_boot;
	struct oled_i2c_buf_s *oled_s;

	default_src = 0;
	devid = 0;
	revid = 0;
	nmea2000_user_id = 0;
	/* read devid and user IDs */
	TBLPTR = 0x200000;
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id;");
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id + 1;");
	TBLPTR = 0x3ffffc;
	asm("tblrd*+;");
	asm("movff TABLAT, _revid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _revid + 1;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid + 1;");

	/* disable unused modules */
	PMD0 = 0x3a; /* keep clock, FVR, and IOC */
#ifdef USE_TIMER2
	PMD1 = 0xfa; /* keep timer0/timer2 */
	PMD2 = 0x03; /* keep can module */
#else
	PMD1 = 0xfe; /* keep timer0 */
	PMD2 = 0x02; /* keep can module, TU16A */
#endif
	PMD3 = 0xd9; /* keep ADC, CM1, CM2 */
	PMD4 = 0xff;
	PMD5 = 0xef; /* keep PWM1 */
	PMD6 = 0xf6; /* keep UART1 and I2C */
	PMD7 = 0xf2; /* keep CLC1, CLC3 and CLC4 */
	PMD8 = 0xfe; /* keep DMA1 */

	ANSELC = 0;
	ANSELB = 0;
	ANSELA = 0x2F; /* RA0, RA1, RA2, RA3 and RA5 analog */

	/* CANRX on RB3 */
	CANRXPPS = 0x0B;
	/* CANTX on RB2 */
	LATBbits.LATB2 = 1; /* output value when idle */
	TRISBbits.TRISB2 = 0;
	RB2PPS = 0x46;

	LATA = 0;
	OLED_RSTN = 0;
	PAC_NDOWN = 0;
	TRISAbits.TRISA4 = 0; /* RA4/OLED_RSTN as outpout */
	TRISCbits.TRISC7 = 0; /* RC7/NDOWN output */

	/* configure watchdog timer for 2s */
	WDTCON0 = 0x16;
	WDTCON1 = 0x07;

	/* configure sleep mode: PRI_IDLE */
	CPUDOZE = 0x80;

