mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	PAC_NDOWN = 1;
	pacops_pending.byte = 0;
	pac_events.byte = 0;
	/* wait 50ms for pac1953 to be up */
	for (c = 0; c < 50; c++) {
		t0 = timer0_read();
		while (timer0_read() - t0 < TIMER0_1MS) {
			; /* wait */
		}
	}

#ifdef USELOG
#if 0
	log_erase();
#endif

	/* look for current block */
	printf("blocks");
	for (c = 0; c < LOG_BLOCKS; c++) {
		printf(" 0x%x", battlog[c].b_flags);
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_PART) {
			/* found it */
			log_cblk = c;
			log_gen = battlog[c].b_flags & B_FILL_GEN;
			break;
		}
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_FULL) {
			uint8_t c2 = (c + 1) & LOG_BLOCKS_MASK;
			if ((battlog[c2].b_flags & B_FILL_STAT)
			    == B_FILL_FREE) {
				/* stopped just at boundary */
				log_cblk = c2;
				log_gen = battlog[c].b_flags & B_FILL_GEN;
				if (log_cblk == 0)
					log_gen += 0x4;
				break;
			}
		}
	}
	printf("\n");
	if (c == LOG_BLOCKS) {
		/* log empty, start a 0 */
		printf("log empty\n");
		log_cblk = 0;
		log_gen = 0;
	}
	/* look for first free entry in block */
	for (c = 0; c < LOG_ENTRIES; c++) {
		if (battlog[log_cblk].b_entry[c].s.nvalid == 1) {
			/* first free entry */
			log_centry = c;
			break;
		}
	}
	if (c == LOG_ENTRIES) {
		/* log corrupted, reset */
		printf("non-full block with no free entry: reset log\n");
		log_erase();
	}
	page_read(&battlog[log_cblk]);

	memset(&curlog.b_entry[log_centry], 0, sizeof(union log_entry));

	next_log_entry();
#endif /* USELOG */

again:
	c = 0;
	PAC_READREG(PAC_PRODUCT, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else 
		printf("product id 0x%x ", i2cr);

	PAC_READREG(PAC_MANUF, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else
		printf("manuf id 0x%x ", i2cr);

	PAC_READREG(PAC_REV, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else
		printf("rev id 0x%x\n", i2cr);

	PAC_READREG(PAC_CTRL_ACT, pac_ctrl);
	if (pac_i2c_flush() == 0)
		c++;
	else {
		printf("CTRL_ACT al1 %d al2 %d mode %d dis %d\n",
		    pac_ctrl.ctrl_alert1,
		    pac_ctrl.ctrl_alert2,
		    pac_ctrl.ctrl_mode,
		    pac_ctrl.ctrl_chan_dis);
	}

	pac_ctrl.ctrl_alert1 = pac_ctrl.ctrl_alert2 = CTRL_ALERT_ALERT;
	pac_ctrl.ctrl_mode = CTRL_MODE_1024;
	pac_ctrl.ctrl_chan_dis = 0x1;

	PAC_WRITEREG(PAC_CTRL, pac_ctrl);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_CTRL fail\n");
		c++;
	}

	pac_accumcfg.accumcfg_acc1 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc2 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc3 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc4 = ACCUMCFG_VSENSE;
	PAC_WRITEREG(PAC_ACCUMCFG, pac_accumcfg);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_ACCUMCFG fail\n");
		c++;
	}

	pac_neg_pwr_fsr.pwrfsr_vs1 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vs2 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vs3 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vs4 = PAC_PWRSFR_BHALF;

	pac_neg_pwr_fsr.pwrfsr_vb1 = PAC_PWRSFR_UFSR;
	pac_neg_pwr_fsr.pwrfsr_vb2 = PAC_PWRSFR_UFSR;
	pac_neg_pwr_fsr.pwrfsr_vb3 = PAC_PWRSFR_UFSR;
	pac_neg_pwr_fsr.pwrfsr_vb4 = PAC_PWRSFR_UFSR;
	PAC_WRITEREG(PAC_NEG_PWR_FSR, pac_neg_pwr_fsr);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_NEG_PWR_FSR fail\n");
		c++;
	}

	PAC_WRITECMD(PAC_REFRESH);
	if (pac_i2c_flush() == 0) {
		printf("cmd PAC_REFRESH fail\n");
		c++;
	}
	if (c != 0)
		goto again;

	/* set up some of our input/output */
	PWM_OFF = 1;
	TRISCbits.TRISC1 = 0;

	PWM_MID = 0;
	TRISCbits.TRISC5 = 0;
	PWM_OUT = 0;
	TRISCbits.TRISC6 = 0;

	TRISCbits.TRISC0 = 1; /* PWM_OK input */


	LATBbits.LATB4 = 0; /* BATT1_ON */
	LATBbits.LATB5 = 0; /* BATT2_ON */
	TRISBbits.TRISB4 = 0;
	TRISBbits.TRISB5 = 0;

	/*
	 * set up CLC for BATT1/BATT2 outputs:
	 * On only if
	 *   - PWM_OFF == 0
	 *   - PWM_OK == 1
	 *   - PWM_MID == 1
	 *   - the other batt is off
	 *   - we want it on
	 */

	/* CLC inputs - carefull with what port is allowed on which CLCIN */
	CLCIN0PPS = 0x10; /* RC0 PWM_OK */
	CLCIN1PPS = 0x11; /* RC1 PWM_OFF */
	CLCIN2PPS = 0x0c; /* RB4 BATT1_ON */
	CLCIN3PPS = 0x0d; /* RB5 BATT2_ON */
	CLCIN4PPS = 0x15; /* RC5 PWM_MID */

	/* setup CLC3 for BATT1_ON */
	CLCSELECT = 2;
	CLCnCON = 0x02; /* 4 input and */
	CLCnPOL = 0x0d; /* 2 noninverted; 1, 3 & 4 inverted */
	CLCnSEL0 = 0; /* CLCIN0PPS = PWM_OK */
	CLCnSEL1 = 1; /* CLCIN1PPS = PWM_OFF */
	CLCnSEL2 = 3; /* CLCIN3PPS = BATT2_ON */
	CLCnSEL3 = 4; /* CLCIN4PPS = PWM_MID */

	CLCnGLS0 = 0x69; /* b01101001 (!PWM_MID|BATT2_ON|PWM_OFF|!PWM_OK) */
	CLCnGLS1 = 0;
	CLCnGLS2 = 0;
	CLCnGLS3 = 0;
	CLCnCONbits.EN = 1;
	RB4PPS = 0x03; /* BATT1_ON = CLC3OUT */

	/* setup CLC4 for BATT2_ON */
	CLCSELECT = 3;
	CLCnCON = 0x02; /* 4 input and */
	CLCnPOL = 0x0d; /* 2 noninverted; 1, 3 & 4 inverted */
	CLCnSEL0 = 0; /* CLCIN0PPS = PWM_OK */
	CLCnSEL1 = 1; /* CLCIN1PPS = PWM_OFF */
	CLCnSEL2 = 2; /* CLCIN2PPS = BATT1_ON */
	CLCnSEL3 = 4; /* CLCIN4PPS = PWM_MID */

	CLCnGLS0 = 0x69; /* b01101001 (!PWM_MID|BATT1_ON|PWM_OFF|!PWM_OK) */
	CLCnGLS1 = 0;
	CLCnGLS2 = 0;
	CLCnGLS3 = 0;
	CLCnCONbits.EN = 1;
	RB5PPS = 0x04; /* BATT2_ON = CLC4OUT */

	/* setup CM1 for PWM output voltage alarm */
	CM1CON0 = 0x02; /* hysteresis */
	CM1CON1 = 0x01; /* interrupt falling edge */
	CM1NCH = 0x00; /* CH1IN0- = RA0 */
	CM1PCH = 0x01; /* CH1IN1+ = vref */
	CM1CON0bits.EN = 0; /* enable when PWM is running */
	PIR1bits.C1IF = 0; /* clear any pending interrupt */
	PIE1bits.C1IE = 0; /* enable when PWM is running */

	/* setup IOC to monitor PWM_OK (RC0) going low */
	IOCAP = IOCBP = IOCCP = IOCEP = 0;
	IOCAN = IOCBN = IOCEN = 0;
	IOCCN = 1;
	PIE0bits.IOCIE = 0; /* enable when PWM is running */

	/* setup CLC1 for PWM reset: (!PWM_OK | !CM1OUT) */
	CLCSELECT = 0;
	CLCnCON = 0x02; /* 4 input and */
	CLCnPOL = 0x0e; /* 1 noninverted; 2, 3 & 4 inverted */
	CLCnSEL0 = 0; /* CLCIN0PPS = PWM_OK */
	CLCnSEL1 = 45; /* CM1OUT */
	CLCnSEL2 = 0; /* CLCIN0PPS = PWM_OK */
	CLCnSEL3 = 0; /* CLCIN0PPS = PWM_OK */

	CLCnGLS0 = 0x05; /* b00000101 (!PWM_OK| !CM1OUT) */
	CLCnGLS1 = 0;
	CLCnGLS2 = 0;
	CLCnGLS3 = 0;
	CLCnCONbits.EN = 1;

	/* setup PWM */
	OSCFRQ = 0x08; /* HFINTOSC at 64Mhz */
	PWM1ERS = 0x0a; /* CLC1_OUT */
	PWM1LDS = 0; /* no autoload */
	PWM1CLK = 0x03; /* use HFINTOSSC: minimum off time = 32 */
	PWM1CPRE = 0; /* no prescale */
	PWM1PR = 512; /* pwm at 125Khz */
	PWM1GIE = 0;
	PWM1CON = 0; /* no enable yet */
	PWM1S1CFG = 0; /* left-aligned mode */
	PWM1S1P1 = 0; /* default to off */
	PWM1S1P2 = 0;
	RC6PPS = 0x18; /* PWM1S1P1_OUT */

	pwm_fsm = PWMF_DOWN;
	pwm_events.byte = 0;
	pwm_error = PWME_NOERROR;

	chrg_fsm = CHRG_DOWN;
	chrg_events.byte = 0;

	active_batt = BATT_1;
	battctx[BATT_2 - BATT_1].bc_cv = 140; /* XXX from eeprom ? */
	battctx[BATT_1 - BATT_1].bc_cv = 140; /* XXX from eeprom ? */
	battctx[BATT_2 - BATT_1].bc_stat = BATTS_NONE;
	battctx[BATT_1 - BATT_1].bc_stat = BATTS_NONE;
	battctx[BATT_2 - BATT_1].bc_chrg_fsm = CHRG_RAMPUP;
	battctx[BATT_1 - BATT_1].bc_chrg_fsm = CHRG_RAMPUP;

	oled_col = 20;
	oled_line = 5;
	sprintf(oled_displaybuf, "hello");
	displaybuf_medium();
	oled_i2c_flush();

	for (c = 0; c < 4; c++) {
		oled_col = 20 * c;
		oled_line = 1;
		displaybuf_icon(c);
	}
	oled_i2c_flush();

	btn_state = BTN_IDLE;

	FVRCON = 0x8c; /* FVR on, CDAFVR 4.096v */

	/* CM2 for button interrupt */
	CM2CON0 = 0x42; /* invert polarity, hysteresis */
	CM2CON1 = 0x03; /* interrupt on both edges */
	CM2NCH = 0x01; /* CH1IN1- */
	CM2PCH = 0x06; /* FVR */
	CM2CON0bits.EN = 1;
	PIR14bits.C2IF = 0; /* clear any pending interrupt */
	PIE14bits.C2IE = 1; /* enable */

	/* wait 1s, clear display and start operations */
	for (c = 0; c < 100; c++) {
		t0 = timer0_read();
		while (timer0_read() - t0 < (TIMER0_1MS * 10)) {
			CLRWDT();
		}
	}

	/* clear display */
	display_clear();
	oled_i2c_flush();
	page_status = 1;
	active_page = 0;

