mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	PIR2bits.ADCH3IF = 0;
	PIE2bits.ADCH3IE = 1;
	ADCTX = 0;
	ADCON0bits.CSEN = 1;
	ADCON0bits.GO = 1;

	printf("enter loop\n");

	while (1) {
		time_events.byte = 0;
		if (softintrs.bits.int_100hz) {
			softintrs.bits.int_100hz = 0;
			time_events.bits.ev_100hz = 1;
			counter_100hz--;
			if (counter_100hz == 0) {
				counter_100hz = 10;
				time_events.bits.ev_10hz = 1;
				counter_10hz--;
				if (counter_10hz == 0) {
					counter_10hz = 10;
					time_events.bits.ev_1hz = 1;
				}
			}
		}
				
		CLRWDT();
		if (C1INTLbits.RXIF) {
			nmea2000_receive();
		}
		if (NCANOK) {
			nmea2000_status = NMEA2000_S_ABORT;
			poll_count = timer0_read();;
		} else if (nmea2000_status != NMEA2000_S_OK) {
			uint16_t ticks, tmrv;

			tmrv = timer0_read();
			ticks = tmrv - poll_count;
			if (ticks > TIMER0_5MS) {
				poll_count = tmrv;
				nmea2000_poll(
				    (u_char)(ticks / TIMER0_1MS));
			}
			if (nmea2000_status == NMEA2000_S_OK) {
				printf("new addr %d\n", nmea2000_addr);
			}
		}

		if (time_events.bits.ev_1hz) {
			adctotemp(0);
			if (board_temp > TEMP_MAX &&
			    chrg_fsm != CHRG_DOWN) {
				pwm_error = PWME_OVERTEMP;
				pwm_events.bits.gooff = 1;
			}
		}

		chrg_runfsm();
		pwm_runfsm();

		if (time_events.bits.ev_10hz &&
		    chrg_fsm == CHRG_DOWN && pwm_error != PWME_NOERROR) {
			if (pwm_error == PWME_OVERTEMP) {
				/* restart when below TEMP_RESTART */
				if (board_temp < TEMP_RESTART) {
					pwm_error = PWME_NOERROR;
					chrg_events.bits.goon = 1;
				}
			} else {
				pwme_time++;
				if (pwme_time >= 10) {
					pwm_error = PWME_NOERROR;
					chrg_events.bits.goon = 1;
				}
			}
		}

		PIE14bits.C2IE = 0;
		if (softintrs.bits.int_btn_down) {
			softintrs.bits.int_btn_down = 0;
			if (btn_state == BTN_IDLE) {
				btn_state = BTN_DOWN;
			}
		}
		if (softintrs.bits.int_btn_up) {
			switch(btn_state) {
			case BTN_DOWN_1_P:
				softintrs.bits.int_btn_up = 0;
				/* this is a up event */
				btn_state = BTN_UP;
				break;
			case BTN_DOWN_2_P:
				next_page();
				softintrs.bits.int_btn_up = 0;
				/* this is a up event */
				btn_state = BTN_UP;
				break;
			case BTN_DOWN:
			case BTN_DOWN_1:
			case BTN_DOWN_2:
				/* not ready for an UP event yet, wait */
				break;
			default:
				/* transient event */
				softintrs.bits.int_btn_up = 0;
				btn_state = BTN_IDLE;
				break;
			}
		}
		PIE14bits.C2IE = 1;

		if (softintrs.bits.int_adcc) {
			switch(ADCTX) {
			case 3:
				PIR2bits.ADCH4IF = 0;
				PIE2bits.ADCH4IE = 0;
				if (btn_state == BTN_DOWN) {
					if (ADRES > 0x600 && ADRES < 0x900) {
						btn_state = BTN_DOWN_2;
					} else if (ADRES > 0x400 &&
						   ADRES < 0x600) {
						btn_state = BTN_DOWN_1;
					} else {
						/* transient event */
						btn_state = BTN_IDLE;
					}
				} else {
					btn_state = BTN_IDLE;
				}
				break;
			default:
				PIR2bits.ADCH3IF = 0;
				ADCON0bits.CSEN = 0;
				/* save channel values */
				ADCTX = 0;
				ad_solar = ADRES;
				ADCTX = 1;
				ad_pwm = ADRES;
				ADCTX = 2;
				ad_temp = ADRES;
				break;
			}
			softintrs.bits.int_adcc = 0;
			if (btn_state != BTN_DOWN) {
				PIR2bits.ADCH3IF = 0;
				PIE2bits.ADCH3IE = 1;
				ADCTX = 0;
				ADCON0bits.CSEN = 1;
				ADCON0bits.GO = 1;
			}
		}

		switch (btn_state) {
		case BTN_DOWN:
			/* get btn value */
			if (!ADCON0bits.GO) {
				ADCON0bits.CSEN = 0;
				ADCTX = 3;
				PIR2bits.ADCH4IF = 0;
				PIE2bits.ADCH4IE = 1;
				ADCON0bits.GO = 1;
			}
			break;
		case BTN_DOWN_1:
			oled_col = 60;
			oled_line = 4;
			sprintf(oled_displaybuf, "  B1 ");
			displaybuf_small();
			printf("B1\n");
			if (pwm_error != PWME_NOERROR) {
				printf("clear PWM error %d\n", pwm_error);
				pwm_error = PWME_NOERROR;
			} else if (pwm_fsm == PWMF_RUNNING) {
				chrg_events.bits.battswitch = 1;
			} else {
				chrg_events.bits.goon = 1;
			}
			btn_state = BTN_DOWN_1_P;
			break;
		case BTN_DOWN_2:
			oled_col = 60;
			oled_line = 4;
			sprintf(oled_displaybuf, "  B2 ");
			displaybuf_small();
			printf("B2\n");
			chrg_events.bits.gooff = 1;
			btn_state = BTN_DOWN_2_P;
			break;
		case BTN_UP:
			oled_col = 60;
			oled_line = 4;
			sprintf(oled_displaybuf, "  up ");
			displaybuf_small();
			printf("up\n");
			btn_state = BTN_IDLE;
			break;
		default:
			break;
		}

		if (time_events.bits.ev_100hz) {
			/* read PAC values every 10ms, but also accum every s */
			if (counter_100hz == 1 && counter_10hz == 1) {
				pacops_pending.bits.refresh = 1;
				pacops_pending.bits.read_accum = 1;
			} else {
				pacops_pending.bits.refresh_v = 1;
			}
			pacops_pending.bits.read_values = 1;
		}
		if (time_events.bits.ev_10hz) {
			display_page();
		
			if (time_events.bits.ev_1hz) {
				seconds++;
				if (seconds == 600) {
					// USELOG update_log();
					seconds = 0;
				}
				// USEADC  ADCON0bits.ADON = 1; /* start a new cycle */
			}
			if (!NCANOK && nmea2000_status == NMEA2000_S_OK) {
				uint16_t ticks, tmrv;

				tmrv = timer0_read();
				ticks = tmrv - poll_count;
				if (ticks > TIMER0_5MS) {
					poll_count = tmrv;
					nmea2000_poll(
					   (u_char)(ticks / TIMER0_1MS));
				}
				if (nmea2000_status != NMEA2000_S_OK) {
					printf("lost CAN bus %d\n",
					    ticks);
				}
			}
		}
		if (pac_events.bits.pacacc_rdy) {
			int64_t acc_value;
			double v;
			char *acc_bytes = (void *)&acc_value;
			pac_events.bits.pacacc_rdy = 0;
			// printf("acc %ld", _read_accum.acc_count.acccnt_count);
			l600_current_count += _read_accum.acc_count.acccnt_count;
			for (c = 0; c < 3; c++) {
				acc_bytes[7] = 0;
				for (char b = 0; b < 7; b++) {
					acc_bytes[b] =
					    _read_accum.accum[c * 7 + b];
				}
				if (acc_value & 0x0080000000000000) {
					/* adjust negative value */
					acc_value |= 0xff00000000000000;
				}
				l600_current_acc[2 - c] += acc_value;
				/* batt_i = acc_value * 0.00075 * 100 */
				v = (double)acc_value * 0.075 / _read_accum.acc_count.acccnt_count;
		                // printf(" %4.4fA", v / 100);

			}
			// printf("\n");
		}
		if (pac_events.bits.pacavg_rdy) {
			double v;
			pac_events.bits.pacavg_rdy = 0;
			// printf("avg");
			for (c = 0; c < 3; c++) {
				/* i = acc_value * 0.00075 */
				/* batt_i = acc_value * 0.00075 * 100 */
				v = (double)_read_voltcur.batt_i[c] * 0.075;
				if (c != 0) {
					/* batt1/batt2 are inverted */
					batt_i[2 - c] = (int16_t)(-v + 0.5);
				} else {
					batt_i[2] = (int16_t)(v + 0.5);
				}

				// printf(" %4.4fA", v / 100);
				/* volt = vbus * 0.000488 */
				/* batt_v = vbus * 0.000488 * 100 */      
				v = (double)_read_voltcur.batt_v[c] * 0.0488;
				batt_v[2 - c] = (uint16_t)(v + 0.5);
				// printf(" %4.4fV", v / 100);
			}
			// printf("\n");
			if (battctx[0].bc_stat == BATT_NONE) {
				if (batt_v[0] / 10 > BATT_MINV) {
					battctx[0].bc_stat = BATTS_CC;
					battctx[0].bc_sw_time = timer0_read();
				}
			}
			if (battctx[1].bc_stat == BATT_NONE) {
				if (batt_v[1] / 10 > BATT_MINV) {
					battctx[1].bc_stat = BATTS_CC;
					battctx[1].bc_sw_time = timer0_read();
				}
			}
			pac_events.bits.bvalues_updated = 1;
			if (pwm_fsm == PWMF_RUNNING) {
				switch(active_batt) {
				case BATT_1:
					c = 2;
					break;
				case BATT_2:
					c = 1;
					break;
				default:
					c = 0; /* shouldn't happen */
					break;
				}
				/* batt current is inverted */
				if (_read_voltcur.batt_i[c] < 0)
					negative_current_count = 0;
				else {
					negative_current_count++;
					printf("battneg %d\n", negative_current_count);
				}
				if (negative_current_count >= 5) {
					pwm_error = PWME_BATTCUR;
					pwm_events.bits.gooff = 1;
				}
			} else {
				negative_current_count = 0;
			}
		}
		if (time_events.bits.ev_10hz) {
			schedule_batt_switch();
		}
		pac_command_schedule();
		while (i2c_return != I2C_INPROGRESS) {
			if (pac_i2c_state < PAC_I2C_WAIT &&
			    oled_i2c_state < OLED_I2C_WAIT) {
				break;
			}

