mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
			/*
			 * pac has higher priority
			 */
			 switch(oled_i2c_state) {
			 case OLED_I2C_CMD:
			 case OLED_I2C_DATA:
				oled_i2c_exec();
				break;
			 case OLED_I2C_WAIT:
				if (pac_i2c_state < PAC_I2C_WAIT)
					oled_i2c_exec();
				break;
			default:
				break;
			}
			if (oled_i2c_state == OLED_I2C_ERROR) {
				if (!oled_error)
					printf("oled i2c error\n"); // XXX
				oled_error = 1;
				oled_i2c_state = OLED_I2C_IDLE;
				oled_i2c_buf[oled_i2c_cons].oled_type = OLED_CTRL_FREE;
			}
			 switch(pac_i2c_state) {
			 case PAC_I2C_READ:
			 case PAC_I2C_WRITE:
				pac_i2c_exec();
				break;
			 case PAC_I2C_WAIT:
				if (oled_i2c_state <= OLED_I2C_WAIT)
					pac_i2c_exec();
				break;
			default:
				break;
			}
			if (pac_i2c_state == PAC_I2C_ERROR) {
				printf("pac i2c error\n"); // XXX
				pac_i2c_state = PAC_I2C_IDLE;
				pac_i2c_io.pac_type = PAC_FREE;
			} else if (pac_i2c_state == PAC_I2C_COMPLETE) {
				pac_command_complete();
				pac_command_schedule();
			}
		}

		if (PIR4bits.U1RXIF && (U1RXB == 'r'))
			break;
		if (default_src != 0) {
			printf("default handler called for 0x%x\n",
			    default_src);
		}
	}
	while ((c = (char)getchar()) != 'r') {
		printf("resumed %u\n", timer0_read());
		goto again;
	}
	WDTCON0bits.SEN = 0;
	printf("returning\n");
	while (!PIR4bits.U1TXIF) {
		; /* wait */ 
	}
	RESET();
	return 0;
}

u_int
timer0_read(void)
{
	u_int value;

	/* timer0_value = TMR0L | (TMR0H << 8), reading TMR0L first */
	di();
	asm("movff TMR0L, timer0_read@value");
	asm("movff TMR0H, timer0_read@value+1");
	ei();
	return value;
}

#ifdef USE_TIMER2
void __interrupt(__irq(TMR2), __high_priority, base(IVECT_BASE))
irqh_timer2(void)
{
	PIR3bits.TMR2IF = 0;
	if (--counter_250hz == 0) {
		counter_250hz = 25;
		softintrs.bits.int_10hz = 1;
	}			
}
#else
void __interrupt(__irq(TU16A), __high_priority, base(IVECT_BASE))
irqh_tu16a(void)
{
	TU16ACON1bits.CLR = 1;
	TU16ACON1bits.PRIF = 0;
	softintrs.bits.int_100hz = 1;
}
#endif

void __interrupt(__irq(IOC), __low_priority, base(IVECT_BASE))
irqh_ioc(void)
{
	PIR0bits.IOCIF = 0;
	IOCCFbits.IOCCF0 = 0;
	PIE0bits.IOCIE = 0;
	pwm_events.bits.gooff = 1;
	pwm_error = PWME_PWMOK;
	pwme_time = 0;
}

void __interrupt(__irq(CM1), __low_priority, base(IVECT_BASE))
irqh_cm1(void)
{
	PIR1bits.C1IF = 0;
	PIE1bits.C1IE = 0;
	pwm_events.bits.gooff = 1;
	pwm_error = PWME_PWMV;
	pwme_time = 0;
}

void __interrupt(__irq(CM2), __low_priority, base(IVECT_BASE))
irqh_cm2(void)
{
	if (CM2CON0bits.OUT)
		softintrs.bits.int_btn_down = 1;
	else 
		softintrs.bits.int_btn_up = 1;
	PIR14bits.C2IF = 0;
}

void __interrupt(__irq(ADCH3), __low_priority, base(IVECT_BASE))
irqh_adcc3(void)
{
	PIE2bits.ADCH3IE = 0;
	softintrs.bits.int_adcc = 1;
}

void __interrupt(__irq(ADCH4), __low_priority, base(IVECT_BASE))
irqh_adcc4(void)
{
	PIE2bits.ADCH4IE = 0;
	softintrs.bits.int_adcc = 1;
}

void __interrupt(__irq(default), __low_priority, base(IVECT_BASE))
irqh_default(void)
{
	default_src = 0xff;
}
